# Задача 26: Напишите программу, которая на вход принимает
# два числа A и B, и возводит число А в целую степень B с
# помощью рекурсии.

# A = 3; B = 5 -> 243 (3⁵)
# A = 2; B = 3 -> 8

# def prime(a,b):
#     if b == 0:
#         return 1
#     return a * prime(a, b-1)
    
# a = int (input('ВВедите число: '))
# b = int (input('ВВедите степень: '))
# print(prime(a,b))




# Задача 28: Напишите рекурсивную функцию sum(a, b),
# возвращающую сумму двух целых неотрицательных чисел. Из
# всех арифметических операций допускаются только +1 и -1.
# Также нельзя использовать циклы.

# 2 2
# 4

# def rescum(a,b):
#     if b == 0:
#         return a
#     return 1 + rescum(a, b-1)

# print(rescum(5, 2))
